Indemsys/Mbed_led_blinky_MKE18F/mbed-os/targets/TARGET_MKE18F/NXP_MKE18F_drivers/fsl_lpuart.h
/*
 * The Clear BSD License
 * Copyright (c) 2015-2016, Freescale Semiconductor, Inc.
 * Copyright 2016-2017 NXP
 * All rights reserved.
 *
 * Redistribution and use in source and binary forms, with or without modification,
 * are permitted (subject to the limitations in the disclaimer below) provided
 *  that the following conditions are met:
 *
 * o Redistributions of source code must retain the above copyright notice, this list
 *   of conditions and the following disclaimer.
 *
 * o Redistributions in binary form must reproduce the above copyright notice, this
 *   list of conditions and the following disclaimer in the documentation and/or
 *   other materials provided with the distribution.
 *
 * o Neither the name of the copyright holder nor the names of its
 *   contributors may be used to endorse or promote products derived from this
 *   software without specific prior written permission.
 *
 * NO EXPRESS OR IMPLIED LICENSES TO ANY PARTY'S PATENT RIGHTS ARE GRANTED BY THIS LICENSE.
 * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS" AND
 * ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE IMPLIED
 * WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
 * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE FOR
 * ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL DAMAGES
 * (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR SERVICES;
 * LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER CAUSED AND ON
 * ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY, OR TORT
 * (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE OF THIS
 * SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
 */
#ifndef _FSL_LPUART_H_
#define _FSL_LPUART_H_

#include "fsl_common.h"

/*!
 * @addtogroup lpuart_driver
 * @{
 */

/*******************************************************************************
 * Definitions
 ******************************************************************************/

/*! @name Driver version */
/*@{*/
/*! @brief LPUART driver version 2.2.5. */
#define FSL_LPUART_DRIVER_VERSION (MAKE_VERSION(2, 2, 5))
/*@}*/

/*! @brief Error codes for the LPUART driver. */
enum _lpuart_status
{
  kStatus_LPUART_TxBusy = MAKE_STATUS(kStatusGroup_LPUART, 0),                  /*!< TX busy */
  kStatus_LPUART_RxBusy = MAKE_STATUS(kStatusGroup_LPUART, 1),                  /*!< RX busy */
  kStatus_LPUART_TxIdle = MAKE_STATUS(kStatusGroup_LPUART, 2),                  /*!< LPUART transmitter is idle. */
  kStatus_LPUART_RxIdle = MAKE_STATUS(kStatusGroup_LPUART, 3),                  /*!< LPUART receiver is idle. */
  kStatus_LPUART_TxWatermarkTooLarge = MAKE_STATUS(kStatusGroup_LPUART, 4),     /*!< TX FIFO watermark too large  */
  kStatus_LPUART_RxWatermarkTooLarge = MAKE_STATUS(kStatusGroup_LPUART, 5),     /*!< RX FIFO watermark too large  */
  kStatus_LPUART_FlagCannotClearManually = MAKE_STATUS(kStatusGroup_LPUART, 6), /*!< Some flag can't manually clear */
  kStatus_LPUART_Error = MAKE_STATUS(kStatusGroup_LPUART, 7),                   /*!< Error happens on LPUART. */
  kStatus_LPUART_RxRingBufferOverrun =
                                      MAKE_STATUS(kStatusGroup_LPUART, 8), /*!< LPUART RX software ring buffer overrun. */
  kStatus_LPUART_RxHardwareOverrun = MAKE_STATUS(kStatusGroup_LPUART, 9), /*!< LPUART RX receiver overrun. */
  kStatus_LPUART_NoiseError = MAKE_STATUS(kStatusGroup_LPUART, 10),       /*!< LPUART noise error. */
  kStatus_LPUART_FramingError = MAKE_STATUS(kStatusGroup_LPUART, 11),     /*!< LPUART framing error. */
  kStatus_LPUART_ParityError = MAKE_STATUS(kStatusGroup_LPUART, 12),      /*!< LPUART parity error. */
  kStatus_LPUART_BaudrateNotSupport = MAKE_STATUS(kStatusGroup_LPUART, 13), /*!< Baudrate is not support in current clock source */
  kStatus_LPUART_IdleLineDetected = MAKE_STATUS(kStatusGroup_LPUART, 14), /*!< IDLE flag. */
};

/*! @brief LPUART parity mode. */
typedef enum _lpuart_parity_mode
{
  kLPUART_ParityDisabled = 0x0U, /*!< Parity disabled */
  kLPUART_ParityEven = 0x2U,     /*!< Parity enabled, type even, bit setting: PE|PT = 10 */
  kLPUART_ParityOdd = 0x3U,      /*!< Parity enabled, type odd,  bit setting: PE|PT = 11 */
} lpuart_parity_mode_t;

/*! @brief LPUART data bits count. */
typedef enum _lpuart_data_bits
{
  kLPUART_EightDataBits = 0x0U, /*!< Eight data bit */
  #if defined(FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT) && FSL_FEATURE_LPUART_HAS_7BIT_DATA_SUPPORT
  kLPUART_SevenDataBits = 0x1U, /*!< Seven data bit */
  #endif
} lpuart_data_bits_t;

/*! @brief LPUART stop bit count. */
typedef enum _lpuart_stop_bit_count
{
  kLPUART_OneStopBit = 0U, /*!< One stop bit */
  kLPUART_TwoStopBit = 1U, /*!< Two stop bits */
} lpuart_stop_bit_count_t;

#if defined(FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT) && FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
/*! @brief LPUART transmit CTS source. */
typedef enum _lpuart_transmit_cts_source
{
  kLPUART_CtsSourcePin = 0U,         /*!< CTS resource is the LPUART_CTS pin. */
  kLPUART_CtsSourceMatchResult = 1U, /*!< CTS resource is the match result. */
} lpuart_transmit_cts_source_t;

/*! @brief LPUART transmit CTS configure. */
typedef enum _lpuart_transmit_cts_config
{
  kLPUART_CtsSampleAtStart = 0U, /*!< CTS input is sampled at the start of each character. */
  kLPUART_CtsSampleAtIdle = 1U,  /*!< CTS input is sampled when the transmitter is idle */
} lpuart_transmit_cts_config_t;
#endif

/*! @brief LPUART idle flag type defines when the receiver starts counting. */
typedef enum _lpuart_idle_type_select
{
  kLPUART_IdleTypeStartBit = 0U, /*!< Start counting after a valid start bit. */
  kLPUART_IdleTypeStopBit = 1U,  /*!< Start conuting after a stop bit. */
} lpuart_idle_type_select_t;

/*! @brief LPUART idle detected configuration.
 *  This structure defines the number of idle characters that must be received before
 *  the IDLE flag is set.
 */
typedef enum _lpuart_idle_config
{
  kLPUART_IdleCharacter1 = 0U,   /*!< the number of idle characters. */
  kLPUART_IdleCharacter2 = 1U,   /*!< the number of idle characters. */
  kLPUART_IdleCharacter4 = 2U,   /*!< the number of idle characters. */
  kLPUART_IdleCharacter8 = 3U,   /*!< the number of idle characters. */
  kLPUART_IdleCharacter16 = 4U,  /*!< the number of idle characters. */
  kLPUART_IdleCharacter32 = 5U,  /*!< the number of idle characters. */
  kLPUART_IdleCharacter64 = 6U,  /*!< the number of idle characters. */
  kLPUART_IdleCharacter128 = 7U, /*!< the number of idle characters. */
} lpuart_idle_config_t;

/*!
 * @brief LPUART interrupt configuration structure, default settings all disabled.
 *
 * This structure contains the settings for all LPUART interrupt configurations.
 */
enum _lpuart_interrupt_enable
{
  #if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
  kLPUART_LinBreakInterruptEnable =(LPUART_BAUD_LBKDIE_MASK >> 8), /*!< LIN break detect. */
  #endif
  kLPUART_RxActiveEdgeInterruptEnable =(LPUART_BAUD_RXEDGIE_MASK >> 8), /*!< Receive Active Edge. */
  kLPUART_TxDataRegEmptyInterruptEnable =(LPUART_CTRL_TIE_MASK),        /*!< Transmit data register empty. */
  kLPUART_TransmissionCompleteInterruptEnable =(LPUART_CTRL_TCIE_MASK), /*!< Transmission complete. */
  kLPUART_RxDataRegFullInterruptEnable =(LPUART_CTRL_RIE_MASK),         /*!< Receiver data register full. */
  kLPUART_IdleLineInterruptEnable =(LPUART_CTRL_ILIE_MASK),             /*!< Idle line. */
  kLPUART_RxOverrunInterruptEnable =(LPUART_CTRL_ORIE_MASK),            /*!< Receiver Overrun. */
  kLPUART_NoiseErrorInterruptEnable =(LPUART_CTRL_NEIE_MASK),           /*!< Noise error flag. */
  kLPUART_FramingErrorInterruptEnable =(LPUART_CTRL_FEIE_MASK),         /*!< Framing error flag. */
  kLPUART_ParityErrorInterruptEnable =(LPUART_CTRL_PEIE_MASK),          /*!< Parity error flag. */
  #if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
  kLPUART_TxFifoOverflowInterruptEnable =(LPUART_FIFO_TXOFE_MASK >> 8),  /*!< Transmit FIFO Overflow. */
  kLPUART_RxFifoUnderflowInterruptEnable =(LPUART_FIFO_RXUFE_MASK >> 8), /*!< Receive FIFO Underflow. */
  #endif
};

/*!
 * @brief LPUART status flags.
 *
 * This provides constants for the LPUART status flags for use in the LPUART functions.
 */
enum _lpuart_flags
{
  kLPUART_TxDataRegEmptyFlag = (LPUART_STAT_TDRE_MASK), /*!< Transmit data register empty flag, sets when transmit buffer is empty */
  kLPUART_TransmissionCompleteFlag = (LPUART_STAT_TC_MASK), /*!< Transmission complete flag, sets when transmission activity complete */
  kLPUART_RxDataRegFullFlag = (LPUART_STAT_RDRF_MASK), /*!< Receive data register full flag, sets when the receive data buffer is full */
  kLPUART_IdleLineFlag =(LPUART_STAT_IDLE_MASK), /*!< Idle line detect flag, sets when idle line detected */
  kLPUART_RxOverrunFlag =(LPUART_STAT_OR_MASK),  /*!< Receive Overrun, sets when new data is received before data is
                                                    read from receive register */
  kLPUART_NoiseErrorFlag =(LPUART_STAT_NF_MASK), /*!< Receive takes 3 samples of each received bit.  If any of these
                                                    samples differ, noise flag sets */
  kLPUART_FramingErrorFlag = (LPUART_STAT_FE_MASK), /*!< Frame error flag, sets if logic 0 was detected where stop bit expected */
  kLPUART_ParityErrorFlag =(LPUART_STAT_PF_MASK), /*!< If parity enabled, sets upon parity error detection */
  #if defined(FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT) && FSL_FEATURE_LPUART_HAS_LIN_BREAK_DETECT
  kLPUART_LinBreakFlag =(LPUART_STAT_LBKDIF_MASK), /*!< LIN break detect interrupt flag, sets when LIN break char
                                                      detected and LIN circuit enabled */
  #endif
  kLPUART_RxActiveEdgeFlag = (LPUART_STAT_RXEDGIF_MASK), /*!< Receive pin active edge interrupt flag, sets when active edge detected */
  kLPUART_RxActiveFlag = (LPUART_STAT_RAF_MASK), /*!< Receiver Active Flag (RAF), sets at beginning of valid start bit */
  #if defined(FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING) && FSL_FEATURE_LPUART_HAS_ADDRESS_MATCHING
  kLPUART_DataMatch1Flag = LPUART_STAT_MA1F_MASK, /*!< The next character to be read from LPUART_DATA matches MA1*/
  kLPUART_DataMatch2Flag = LPUART_STAT_MA2F_MASK, /*!< The next character to be read from LPUART_DATA matches MA2*/
  #endif
  #if defined(FSL_FEATURE_LPUART_HAS_EXTENDED_DATA_REGISTER_FLAGS) && FSL_FEATURE_LPUART_HAS_EXTENDED_DATA_REGISTER_FLAGS
  kLPUART_NoiseErrorInRxDataRegFlag = (LPUART_DATA_NOISY_MASK >> 10), /*!< NOISY bit, sets if noise detected in current data word */
  kLPUART_ParityErrorInRxDataRegFlag = (LPUART_DATA_PARITYE_MASK >> 10), /*!< PARITYE bit, sets if noise detected in current data word */
  #endif
  #if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
  kLPUART_TxFifoEmptyFlag =(LPUART_FIFO_TXEMPT_MASK >> 16), /*!< TXEMPT bit, sets if transmit buffer is empty */
  kLPUART_RxFifoEmptyFlag =(LPUART_FIFO_RXEMPT_MASK >> 16), /*!< RXEMPT bit, sets if receive buffer is empty */
  kLPUART_TxFifoOverflowFlag = (LPUART_FIFO_TXOF_MASK >> 16), /*!< TXOF bit, sets if transmit buffer overflow occurred */
  kLPUART_RxFifoUnderflowFlag = (LPUART_FIFO_RXUF_MASK >> 16), /*!< RXUF bit, sets if receive buffer underflow occurred */
  #endif
};

/*! @brief LPUART configuration structure. */
typedef struct _lpuart_config
{
  uint32_t baudRate_Bps;            /*!< LPUART baud rate  */
  lpuart_parity_mode_t parityMode;  /*!< Parity mode, disabled (default), even, odd */
  lpuart_data_bits_t dataBitsCount; /*!< Data bits count, eight (default), seven */
  bool isMsb;                       /*!< Data bits order, LSB (default), MSB */
  #if defined(FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT) && FSL_FEATURE_LPUART_HAS_STOP_BIT_CONFIG_SUPPORT
  lpuart_stop_bit_count_t stopBitCount; /*!< Number of stop bits, 1 stop bit (default) or 2 stop bits  */
  #endif
  #if defined(FSL_FEATURE_LPUART_HAS_FIFO) && FSL_FEATURE_LPUART_HAS_FIFO
  uint8_t txFifoWatermark; /*!< TX FIFO watermark */
  uint8_t rxFifoWatermark; /*!< RX FIFO watermark */
  #endif
  #if defined(FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT) && FSL_FEATURE_LPUART_HAS_MODEM_SUPPORT
  bool enableRxRTS;                         /*!< RX RTS enable */
  bool enableTxCTS;                         /*!< TX CTS enable */
  lpuart_transmit_cts_source_t txCtsSource; /*!< TX CTS source */
  lpuart_transmit_cts_config_t txCtsConfig; /*!< TX CTS configure */
  #endif
  lpuart_idle_type_select_t rxIdleType; /*!< RX IDLE type. */
  lpuart_idle_config_t rxIdleConfig;    /*!< RX IDLE configuration. */
  bool enableTx;                        /*!< Enable TX */
  bool enableRx;                        /*!< Enable RX */
} lpuart_config_t;

/*! @brief LPUART transfer structure. */
typedef struct _lpuart_transfer
{
  uint8_t *data;   /*!< The buffer of data to be transfer.*/
  size_t dataSize; /*!< The byte count to be transfer. */
} lpuart_transfer_t;

